# ============================================================
# Taps
# ============================================================
tap "azure/functions"
tap "dotenvx/brew"
tap "manaflow-ai/cmux"
tap "oven-sh/bun"
tap "productdevbook/tap"
tap "steipete/tap"
tap "stripe/stripe-cli"
tap "ungive/media-control"
tap "yakitrak/yakitrak"
tap "resend/cli"
tap "xcodesorg/made"

# ============================================================
# CLI Tools
# ============================================================
# Download with resuming and segmented downloading
brew "aria2"
# 1Password CLI — `op read` for secret/SSH-key provisioning (op-ssh-provision.sh)
cask "1password-cli"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Manage your dotfiles across multiple diverse machines
brew "chezmoi"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Command-line fuzzy finder written in Go
brew "fzf"
# Render markdown on the CLI (the `view` dispatcher's markdown renderer)
brew "glow"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU grep, egrep and fgrep
brew "grep"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Apple Silicon Monitor Top written in Go Lang
brew "mactop"
# Control and observe media playback from the command-line
brew "media-control"
# Fast, highly customisable system info script (neofetch discontinued upstream; fastfetch is the maintained successor)
brew "fastfetch"
# Port scanning utility for large networks
brew "nmap"
# Multipurpose relay (used by shell TTS/SSH notification pipeline)
brew "socat"
# Retrieves currently playing media, and simulates media actions
brew "nowplaying-cli"
# Paste PNG into files
brew "pngpaste"
# PAM module so TouchID-for-sudo (pam_tid) works inside tmux/screen sessions
brew "pam-reattach"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# Command-line utility to interact with Sentry
brew "sentry-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# High-performance, platform-neutral implementation of VNC
brew "tiger-vnc"
# Terminal multiplexer
brew "tmux"
# Watch files and take action when they change
brew "watchman"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"

# ============================================================
# Secrets & Environment
# ============================================================
# Secure dotenv - from the creator of `dotenv`
brew "dotenvx/brew/dotenvx"

# ============================================================
# Runtime Managers & Languages
# ============================================================
# Polyglot runtime manager (asdf rust clone) - replaces nvm, manages node/pnpm
brew "mise"
# Fast, disk space efficient package manager
brew "pnpm"
# .NET Core (latest stable, currently SDK 10)
brew "dotnet"
# .NET 9 SDK side-by-side
brew "dotnet@9"
# .NET 8 SDK side-by-side (LTS until Nov 2026)
brew "dotnet@8"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Safe, concurrent, practical language
brew "rust"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one
brew "oven-sh/bun/bun"

# ============================================================
# Cloud & DevOps
# ============================================================
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Azure Functions Core Tools 4.0
brew "azure/functions/azure-functions-core-tools@4"
# Bicep is NOT a Homebrew formula — installed via `az bicep install` in
# run_once_install-packages.sh.tmpl (binary lands at ~/.azure/bin/bicep,
# symlinked into ~/.local/bin so Zed's bicep langserver finds it).
# Pack, ship and run any application as a lightweight container
brew "docker"
# Lightweight container runtime (Docker Desktop alternative, uses Lima VMs)
brew "colima"
# Generate Xcode project files from a spec file
brew "xcodegen"
# Install + switch Xcode versions from the CLI (used by bootstrap GATE 2:
# `xcodes install --latest`) — required for cold-start Xcode provisioning.
brew "xcodesorg/made/xcodes"
# Command-line tools for fly.io services
brew "flyctl"
# Stripe CLI
brew "stripe/stripe-cli/stripe"
# Object-relational database system
brew "postgresql@17"
# Protocol buffers (Google's data interchange format)
brew "protobuf"

# Email API CLI (send emails, manage domains, API keys, webhooks)
brew "resend/cli/resend"

# ============================================================
# AI & Media
# ============================================================
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# General-purpose speech recognition model
brew "openai-whisper"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Dependency manager for Cocoa projects
brew "cocoapods"

# ============================================================
# Third-Party Tap Tools
# ============================================================
# Send and read iMessage / SMS from the terminal
brew "steipete/tap/imsg"
# Fast CLI for Apple Reminders
brew "steipete/tap/remindctl"
brew "yakitrak/yakitrak/obsidian-cli"

# ============================================================
# Casks - Terminals & Dev Tools
# ============================================================
# Ghostty - GPU-accelerated terminal emulator
cask "ghostty"
# Ghostty-based terminal with vertical tabs and notifications for AI coding agents
cask "cmux"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm@nightly"
# Terminal emulator, SSH and serial client
cask "tabby"
# Write, edit, and chat about your code with AI
cask "cursor"
# Open-source code editor
cask "visual-studio-code"
# Native Rust editor with built-in LSP / remote SSH (trial period 2026-04-26 → 2026-05-03)
cask "zed"
# Git client focusing on productivity
cask "gitkraken"
# CLI for GitKraken
cask "gitkraken-cli"
# Git Credential Manager - cross-platform Git credential storage
# cask "git-credential-manager"
# Open source IDE for exploring and testing APIs
cask "bruno"
# API platform for building and testing APIs
cask "postman"
# Postman CLI for running collections
cask "postman-cli"
# GitHub Copilot CLI
cask "copilot-cli"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Universal database tool and SQL client
cask "dbeaver-community"
# Server and cloud storage browser
cask "cyberduck"
# Desktop automation application
cask "hammerspoon"
# Keyboard customiser
cask "karabiner-elements"
# OpenAI Codex - terminal coding agent
cask "codex"
# Menu bar dashboard for GitHub repository health
cask "steipete/tap/repobar"

# ============================================================
# Casks - Browsers
# ============================================================
# Web browser
cask "google-chrome"
# WebKit based web browser
cask "orion"

# ============================================================
# Casks - Productivity & Communication
# ============================================================
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Calendar software
cask "fantastical"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Control your tools with a few keystrokes
cask "raycast"
# Email client
cask "superhuman"
# Voice and text chat software
cask "discord"
# Messaging app with a focus on speed and security
cask "telegram"
# Connect to Windows
cask "windows-app"
# Mesh VPN — carries the SSH mesh between Mac, Homelab, and CloudPC (see ssh-mesh/)
cask "tailscale-app"

# Microsoft work apps — proxied via ProxyBridge for CAE bypass.
# Process names MUST match scripts/proxybridge-rules.json (Edge/Teams/Outlook).
# Chromium browser
cask "microsoft-edge"
# Group chat and collaboration
cask "microsoft-teams"
# Email, calendar, and contacts
cask "microsoft-outlook"

# ============================================================
# Casks - Media & Entertainment
# ============================================================
# Free and open-source media player
cask "iina"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"

# ============================================================
# Fonts
# ============================================================
cask "font-geist-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# ============================================================
# VS Code Extensions
# ============================================================
vscode "aaron-bond.better-comments"
vscode "anthropic.claude-code"
vscode "azurite.azurite"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.npm-intellisense"
vscode "cyberbiont.vscode-open-in-typora"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "github.copilot-chat"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "raillyhugo.one-hunter"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "tal7aouy.icons"
vscode "vira.vsc-vira-theme"
vscode "vscode-icons-team.vscode-icons"
vscode "yandeu.five-server"
vscode "yoavbls.pretty-ts-errors"

# ============================================================
# UV Packages
# ============================================================
uv "claude-monitor"
