# tap "homebrew/bundle"
# tap "homebrew/cask"
# tap "homebrew/core"
# Microsoft Azure CLI
brew "azure-cli"
# .NET runtime
brew "dotnet"
# Fast, highly customizable system info script, replaces neofetch
brew "hyfetch"
# Node.js
brew "node"
# nvm
brew "nvm"
# pnpm
brew "pnpm"
# starship
brew "starship"
# tmux - terminal multiplexer
brew "tmux"
# zsh-autosuggestions
brew "zsh-autosuggestions"
# zsh-syntax-highlighting
brew "zsh-syntax-highlighting"

# stripe
brew "stripe/stripe-cli/stripe"

# postgresql
brew "postgresql"

# curl (provides libcurl for building C tools)
brew "curl"

# SwitchAudioSource - CLI for audio device switching
brew "switchaudio-osx"

# Git Credential Manager - cross-platform Git credential storage
cask "git-credential-manager"

# Adobe Creative Cloud
# cask "adobe-creative-cloud"
# DB Pro - installed via scripts/dbpro.sh (not in Homebrew)
# https://www.dbpro.app/
# Bruno
cask "bruno"
# Cursor
cask "cursor"
# Discord
cask "discord"
# Fantastical
cask "fantastical"
# Nerd Fonts (required for starship icons)
cask "font-geist-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-cascadia-mono-nerd-font"
# Gitkraken
cask "gitkraken"
# IINA - modern macOS media player (used by ani-cli)
cask "iina"
# Karabiner-Elements - keyboard customization
cask "karabiner-elements"
# Google Chrome
cask "google-chrome"
# Notion
cask "notion"
# Obsidian
cask "obsidian"
# Raycast
cask "raycast"
# Spotify
cask "spotify"
# Steam
cask "steam"
# Superhuman
cask "superhuman"
# Wispr Flow - AI voice dictation
cask "wispr-flow"
# Telegram
# cask "telegram"
# Visual Studio Code
# cask "visual-studio-code"
# WezTerm
# cask "wezterm"
# Windows App
# cask "windows-app"